#!/usr/bin/env bash
# Быстрая памятка по клавишам Hyprland

BACKEND=wayland

if pidof rofi >/dev/null; then
  pkill rofi
fi

if pidof yad >/dev/null; then
  pkill yad
fi

GDK_BACKEND=$BACKEND yad \
  --center \
  --title="Горячие клавиши Hyprland" \
  --no-buttons \
  --list \
  --column=Клавиша: \
  --column=Описание: \
  --column=Примечание: \
  --timeout-indicator=bottom \
"📋 BLUETOOTH (если мышь тупит)" "Подключение через консоль" "" \
"bluetoothctl" "Открыть консоль Bluetooth" "" \
"power on" "Включить Bluetooth" "" \
"agent on" "Включить агент" "" \
"default-agent" "Назначить агент по умолчанию" "" \
"scan on" "Начать сканирование" "" \
"scan off" "Остановить сканирование" "" \
"pair XX:XX:XX:XX:XX:XX" "Сопрячь устройство" "Вставь свой MAC" \
"trust XX:XX:XX:XX:XX:XX" "Доверять устройству" "" \
"connect XX:XX:XX:XX:XX:XX" "Подключиться" "" \
"exit" "Выйти из bluetoothctl" "" \
"" "" "" \
"ESC" "Закрыть окно" "" \
" = " "Клавиша SUPER" "Обычно Win" \
" SHIFT K" "Поиск по биндам" "Через rofi" \
" SHIFT E" "Меню настроек Hyprland" "" \
"" "" "" \
" ENTER" "Терминал" "mlterm" \
" SHIFT ENTER" "Drop-down терминал" " Q — закрыть" \
" B" "Браузер" "По умолчанию" \
" SHIFT B" "Менеджер Bluetooth" "blueman-manager" \
" A" "Обзор рабочего стола" "Quickshell" \
" SPACE" "Запуск приложений" "rofi-wayland" \
" E" "Файловый менеджер" "thunar" \
" S" "Поиск в интернете" "через rofi" \
" T" "Переключение темы" "wallust/rofi" \
" Q" "Закрыть активное окно" "без kill" \
" SHIFT Q" "Завершить процесс окна" "kill" \
" ALT колесо" "Зум рабочего стола" "лупа" \
" ALT V" "Буфер обмена" "cliphist" \
" W" "Выбрать обои" "" \
" SHIFT W" "Эффекты обоев" "imagemagick + swww" \
"CTRL ALT W" "Случайные обои" "через swww" \
" CTRL ALT B" "Скрыть/показать Waybar" "" \
" CTRL B" "Стили Waybar" "" \
" ALT B" "Макеты Waybar" "" \
" ALT R" "Перезапуск панелей" "Waybar + swaync + rofi" \
" SHIFT N" "Панель уведомлений" "swaync" \
" Print" "Скриншот" "grim" \
" SHIFT Print" "Скриншот области" "grim + slurp" \
" SHIFT S" "Скриншот в swappy" "" \
" CTRL Print" "Скриншот через 5 сек" "" \
" CTRL SHIFT Print" "Скриншот через 10 сек" "" \
"ALT Print" "Скриншот активного окна" "" \
"CTRL ALT P" "Меню питания" "wlogout" \
"CTRL ALT L" "Блокировка экрана" "hyprlock" \
"CTRL ALT Del" "Выход из Hyprland" "сразу" \
" SHIFT F" "Полный экран" "" \
" CTRL F" "Псевдо-полный экран" "" \
" ALT L" "Dwindle / Master" "смена layout" \
" SPACEBAR" "Плавающее окно" "текущее" \
" ALT SPACEBAR" "Плавающие окна" "все" \
" ALT O" "Переключить blur" "" \
" CTRL O" "Прозрачность окна" "active only" \
" SHIFT A" "Меню анимаций" "" \
" CTRL R" "Темы Rofi" "быстрый выбор" \
" CTRL SHIFT R" "Темы Rofi (preview)" "расширенный выбор" \
" SHIFT G" "Игровой режим" "анимации ON/OFF" \
" ALT E" "Эмодзи" "rofi" \
" H" "Открыть эту памятку" "" \
"" "" "" \
"Подсказка" "Список биндов" "$HOME/.config/hypr/configs/Keybinds.conf"
